tap "azure/kubelogin"
tap "hashicorp/tap"
tap "kudulab/dojo-osx"
tap "pivotal/tap"
tap "punitlad/tap", "/Users/punitlad/projects/homebrew-tap"
tap "sdkman/tap"
tap "versent/taps"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bash Automated Testing System
brew "bats-core"
# User-friendly launcher for Bazel
brew "bazelisk"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Convert AWS CloudFormation templates between JSON and YAML formats
brew "cfn-flip"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Core application library for C
brew "glib"
# Go version management
brew "goenv"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# CLI for Mermaid library
brew "mermaid-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Multiple Repository management tool
brew "mr"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# AI coding agent, built for the terminal
brew "opencode"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Command-line tool for working with AWS CloudFormation
brew "rain"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# Intuitive find & replace CLI
brew "sd"
# Autoformat shell script source code
brew "shfmt"
# Zsh prompt for Astronauts
brew "spaceship"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Suite of barcodes-reading tools
brew "zbar"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# E-book reader
cask "adobe-digital-editions"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cloud native persistent desktop virtualization
cask "amazon-workspaces"
# Android SDK component
cask "android-platform-tools"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Audio utility
cask "background-music"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Desktop client for Ente Photos
cask "ente"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Game launcher
cask "heroic"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal built on web technologies
cask "hyper@canary"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source video calls and chat
cask "jitsi"
# Free and open-source media player
cask "kodi"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Speech recognition tool
cask "macwhisper"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# GameStream client
cask "moonlight"
# Privacy-focused note taking app
cask "notesnook"
# Remote desktop
cask "parsec"
# Cloud-based, multi-factor authentication
cask "pingid"
# Home media server
cask "plex-media-server"
# Install games and apps compiled for Microsoft Windows
cask "porting-kit"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open source virtual/remote desktop application
cask "rustdesk"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Voice communication client
cask "teamspeak-client"
# Virtual machines UI using QEMU
cask "utm"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Rust-based terminal
cask "warp"
# Web browser
cask "waterfox"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "AdBlock", id: 1402042596
mas "AdGuard for Safari", id: 1440147259
mas "Floating", id: 1508833245
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Okta Verify", id: 490179405
mas "OnScreen", id: 6469731201
mas "Pixelmator Pro", id: 1289583905
mas "Yomu", id: 562211012
vscode "anthropic.claude-code"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "mermaidchart.vscode-mermaid-chart"
