brew "cask"
tap "pivotal/tap"
tap "sdkman/tap"
brew "tig"
brew "jq"
brew "yq"
brew "thefuck"
brew "watch"
brew "wget"
brew "pyenv"
brew "rbenv"
brew "jenv"
brew "goenv"
brew "tfenv"
brew "sdkman-cli"
brew "nvm"
brew "gh"
brew "circleci"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mr"
brew "direnv"
brew "colima"
brew "colordiff"
brew "awscli"
brew "docker"
brew "docker-compose"
brew "helm"
brew "kubernetes-cli"
brew "k9s"
brew "httpie"
brew "minikube"
brew "pre-commit"
brew "spaceship"
brew "mas"

# Casks list 
cask "1password"
cask "dash"
cask "adobe-acrobat-reader"
cask "discord"
cask "jitsi"
cask "iina"
cask "signal"
cask "aws-vault"
cask "love"
cask "slack"
cask "cool-retro-term"
cask "brave-browser"
cask "firefox"
cask "iterm2"
cask "caffeine"
cask "moonlight"
cask "openemu"
cask "adobe-acrobat-reader"
cask "plex-media-server"
cask "quicksilver"
cask "spotify"
cask "steam"
cask "wireshark"
cask "intellij-idea"
cask "zoom"
cask "rectangle"
cask "signal"
cask "whatsapp"
