brew "cask"
tap "homebrew/cask-versions"
tap "pivotal/tap"
brew "tig"
brew "jq"
brew "pass"
brew "cowsay"
brew "thefuck"
brew "plantuml"
brew "lua"
brew "pwgen"
brew "watch"
brew "wget"
brew "pyenv"
brew "rbenv"
brew "jenv"
brew "go"
brew "git-lfs"
brew "gh"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mr"
brew "direnv"

# Casks list 
cask "1password"
cask "dash"
cask "screen"
cask "discord"
cask "jitsi"
cask "docker"
cask "iina"
cask "signal"
cask "aws-vault"
cask "love"
cask "postman"
cask "slack"
cask "brave-browser"
cask "firefox"
cask "iterm2"
cask "pycharm"
cask "caffeine"
cask "goland"
cask "openemu"
cask "visual-studio-code"
cask "microsoft-teams"
cask "amazon-music"
cask "adobe-acrobat-reader"
cask "plex-media-server"
cask "quicksilver"
cask "yt-music"
cask "steam"
cask "wireshark"
cask "intellij-idea"
cask "zoomus"
cask "rectangle"
cask "whatsapp"
